<?php
/* ใช้ && (หรือ and) ถ้าต้องการให้เงื่อนไขทั้งหมดเป็นจริงจึงจะทำตามคำสั่ง
ใช้ || (หรือ or) ถ้าต้องการให้เพียงเงื่อนไขอันใดอันหนึ่งเป็นจริงจึงทำตามคำสั่ง
*/

if ($login == "admin") && ($password == "12345"){
    echo "ท่านเข้าสู่ระบบแล้ว";
}
else{
    echo "รหัสผ่านไม่ถูกต้อง";
}

#or
if (($today == "Saturday") || ($today == "Sunday")){
    echo "วันนี้วันหยุด";
}

#or
// ถ้าผู้ชายต้องแต่งงานแล้ว หรือถ้าเป็นผู้หญิงยังต้องโสด
if((gender == "male" && status == "married") || (gender == "female" && status == "single")){
    
}
?>
