<?php
//คำสั่งหยุดการทำงานของเพจ
// บางกรณีอาจจะมีเงื่อนไขบางอย่างที่ทำให้โปรแกรมไม่สามารถทำงานต่อไปได้หรืออาจจะทำงานจนครบส่วนที่ต้องการแล้วก็ไม่ต้องไปืำงานในส่วนอื่นต่อ
// หรืออาจเป็นการหยุดทำงานเพียงชั่วขณะซึ่งจากเหตุผลเหล่านี้จึงมีคำสั่งที่เป็นทางเลือกไว้ให้โปรแกรมสามารถหยุดทำงานได้ถ้าจำเป็น

// Exit หรือ die ทั้ง Exit และ die ต่างก็ใช้หยุดการทำงานหรือการประมวลผลส่วนที่เหลือของเพจนั้น
//โดยโค้ดที่อยู่หลังจากคำสั่งนี้ไปแล้วจะถูกยกเลิกการทำงานของเพจทั้งหมด

$sum = 0;
echo "sum of 1 -";
for($i = 1; $i<=10; $i++){
    $sum += $i;
    if ($sum >= 30){
        echo $i;
        exit;
    }
}
echo "$x" . $sum;
/* จะเห็นว่าการแสดงผลยังไม่สมบูรณ์ เพราะการใช้คำสั่ง exit ทุกอย่างที่อยู่ต่อจากนั้นจะถูกยกเลิกทั้งหมด
ดังนั้นเราต้องใช้อย่างระมัดระวัง โดยส่วนไหนที่ต้องการให้ถูกประมวลผลก่อนหยุด ให้วางไว้ก่อน exit
*/
$sum2 = 0;
echo "sum of 1 -";
for($j=1;$j<=10;$j++){
    $sum2 += $j;
    if($sum2>=30){
        $a=$j;
        echo "$a=$sum2";
        exit;
    }
}
?>