/*#########################################################################################################
                                        NaN (Not a Number)
#########################################################################################################*/

//JS มีฟังก์ชั่น isNaN() เพื่อตรวจสอบว่าค่าที่ระบุเป็น NaN หรือไม่ซึ่งหากใช่จะคืนค่า true แต่ถ้าไม่ใช่จะคืนค่า false เช่น
var x = isNaN('100Bath')        //true
var y = isNaN('100' * 'Bath')   //true
var z = isNaN(100)              //false

console.log(x,y,z)