/*#########################################################################################################
                                                Infinity
#########################################################################################################*/

/*ค่า infinity เกิดจาก...
    1. ตัวตั้งเป็นตัวเลขที่ไม่ใช่ 0 แต่ตัวหารเป็น 0 เช่น 1/0
    2. กำหนดตัวเลขที่มีค่ามากกว่า 1.7976931348623157e+308 หรือติดลบที่น้อยกว่า -1.7976931348623157e+308 เช่น */

let a = 1 / 0           //* Infinity
let b = -1 / 0          // -Infinity
let c = 1.8e+308        //* Infinity
let d = -1.8e+308       // -Infinity
let e = 1.7e+308        //* 1.7e+308    (ยังไม่ถึง Infinity)
let f = -1.7e+308       // 1.7e+308     (ยังไม่ถึง Infinity)

//!ใน JS มีฟังก์ชัน isFinite() เพื่อตรวจสอบว่าค่าที่ระบุไม่ใช่ Infinity หรือไม่
    /*หากไม่ใช่ค่า Infinity จะคืนค่า true
    หากใช่ค่า Infinity จะคืนค่า false เช่น*/

console.log(isFinite( 1 / 0))       //false
console.log(isFinite( -1 / 0))      //*false
console.log(isFinite( 1.8e+308))    //false
console.log(isFinite( 1.7e+308))    //*true


