/*#########################################################################################################
                                    Compare false value with ||
#########################################################################################################*/

//มักจะใช้ในตัวแปรที่มีโอกาสจะมีค่าเป็น 0, false, "", null, undefined, NaN 

/*      false || x = > x              null || x => x    
        0 || x => x                   undefined || x => x
        "" || x => x                  NaN || x => x
*/

let a 
let b = a || 1       
console.log(b)      //! 1

let c = 'ha' * 3
console.log('type of c is',typeof(c))
let d = c || 555    
console.log(d)      //! 555