/*#########################################################################################################
                                        Template Literal
#########################################################################################################*/

//!  เอาไว้ใช้แก้ปัญหาเวลารวมสตริงเป็นตัวเดียว แล้วเกิดความยุ่งยาก

//  การแทรกตัวแปรลงในสตริง (String Interpolation)

//*  วิธีการคือกำหนด `` (Backtick) เช่น console.log(`${ตัวแปร}`) เช่น

//  ex01
var c = 5
var n = 'สมชาย'
console.log(`เชิญคุณ ${n} มารับยาที่ช่อง ${c} ค่ะ`)

//  ex02
let mu = 2
let lp = 3
let result = `ManU ${mu} - ${lp} Liverpool`
console.log(result)     //* ManU 2 - 3 Liverpool

//! ภายใน {} สามารถมีการคำนวณค่า, เรียกฟังก์ชั่น หรืออื่น ๆ ได้ เช่น

//  ex03
let m = 10
console.log(`ระยะทาง ${m} ไมล์ เท่ากับ ${ m * 1.6 } กิโลเมตร`)  //*  ระยะทาง 10 ไมล์ เท่ากับ 16 กิโลเมตร

//  ex04
let b = 2
let p = 3
console.log(`${b} ยกกำลัง ${p} เท่ากับ ${b ** p} `)     //* 2 ยกกำลัง 3 เท่ากับ 8

// ex05
let current_year = (new Date()).getFullYear()   //! Set = current year = ปีนี้
let created_year = 1995
console.log(
`#############################################
JavaScript ถูกสร้างขึ้นเมื่อปี ${created_year}
ปัจจุบันตรงกับปี ${current_year}
ดังนั้น JavaScript มีอายุ ${current_year - created_year} ปี
#############################################`)

