/*#########################################################################################################
                                        Special Character
#########################################################################################################*/

/*  
        \n  =   newline
        \t  =   tab
        \"  =   insert "
        \'  =   inset '
        \`  =   insert `
        \\  =   insert \    
*/

//! \n และ  \t มีผลเฉพาะ console.log() ถ้าเป็น Webpage จะมีผลกับข้อความจำพวก Dialog เท่านั้น
